emacs-config.org
** cape
#+BEGIN_SRC emacs-lisp
  ;; Add extensions
  (use-package cape
    :ensure t
    :commands (cape-file cape-elisp-block cape-keyword)
    :autoload (cape-wrap-noninterruptible cape-wrap-nonexclusive cape-wrap-buster)
    :autoload (cape-wrap-silent)
    :init
    ;; (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-elisp-block)
    (add-to-list 'completion-at-point-functions #'cape-keyword)
    ;; (add-to-list 'completion-at-point-functions #'cape-abbrev)

    ;; Make these capfs composable.
    (advice-add 'lsp-completion-at-point :around #'cape-wrap-noninterruptible)
    (advice-add 'lsp-completion-at-point :around #'cape-wrap-nonexclusive)
    (advice-add 'comint-completion-at-point :around #'cape-wrap-nonexclusive)
    (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster)
    (advice-add 'eglot-completion-at-point :around #'cape-wrap-nonexclusive)
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-nonexclusive))
#+END_SRC

** yasnippet补全模版
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
  :ensure t
  :diminish yas-minor-mode
  :hook ((after-init . yas-reload-all)
         ((prog-mode LaTeX-mode org-mode) . yas-minor-mode))
  :config
  ;; Suppress warning for yasnippet code.
  (require 'warnings)
  (add-to-list 'warning-suppress-types '(yasnippet backquote-change))

  (setq yas-prompt-functions '(yas-x-prompt yas-dropdown-prompt))
  (defun smarter-yas-expand-next-field ()
    "Try to `yas-expand' then `yas-next-field' at current cursor position."
    (interactive)
    (let ((old-point (point))
          (old-tick (buffer-chars-modified-tick)))
      (yas-expand)
      (when (and (eq old-point (point))
                 (eq old-tick (buffer-chars-modified-tick)))
        (ignore-errors (yas-next-field))))))
  ;; 追加一些模版
  (use-package yasnippet-snippets
    :ensure t)
#+END_SRC
** init-completion.el 文件尾

#+BEGIN_SRC emacs-lisp

(provide 'init-completion)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; init-org.el ends here
#+END_SRC

* init-git.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-git.el :mkdirp yes
:END:

** init-git 文件头
#+BEGIN_SRC emacs-lisp
  ;;; init-git.el --- Org mode settings -*- lexical-binding: t -*-
  ;;; Commentary:

  ;;; Code:
  #+END_SRC

** 配置magit
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t
    :hook (git-commit-mode . flyspell-mode)
    :bind (("C-x g"   . magit-status)
           ("C-x M-g" . magit-dispatch)
           ("C-c M-g" . magit-file-dispatch))
    :custom
    (magit-diff-refine-hunk t)
    (magit-ediff-dwim-show-on-hunks t))
#+END_SRC

** 追加关于todo的显示
#+begin_src emacs-lisp
  ;; Show TODOs in Magit
  (use-package magit-todos
    :ensure t
    :after magit-status
    :commands magit-todos-mode
    :init
    (setq magit-todos-nice (if (executable-find "nice") t nil))
    (magit-todos-mode 1))
#+end_src
** 高亮显示修改部分内容
#+BEGIN_SRC emacs-lisp
  (use-package diff-hl
    :ensure t
    :hook ((dired-mode         . diff-hl-dired-mode-unless-remote)
           (magit-pre-refresh  . diff-hl-magit-pre-refresh)
           (magit-post-refresh . diff-hl-magit-post-refresh))
    :init
    (global-diff-hl-mode t)
    :config
    ;; When Emacs runs in terminal, show the indicators in margin instead.
    (unless (display-graphic-p)
      (diff-hl-margin-mode)))
#+END_SRC
** init-git 文件尾

#+BEGIN_SRC emacs-lisp

  (provide 'init-git)
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;; init-git.el ends here
  #+END_SRC
